{
  "type": "network",
  "version": "1.0",
  "data": "data.json",
  "logo": {
    "file": "",
    "link": "",
    "text": "Milla Campbell"
  },
  "text": {
    "more": "Linkd. is an interactive network visualisation of a sample of my LinkedIn connections. It contains the attributes of Company, Education, Industry and Location. Nodes can be individually manipulated to ascertain more information relating to these attributes. This network visualisation enables an interactive way of interpreting and understanding data concerning LinkedIn connections, identifying the edges present as an indication of strong and weak ties.  This project was designed and developed for the UTS subject 54063 Code as Literacy, Commodity, Infrastructure. This content is copyright of © Milla Campbell 2021. All rights reserved. Any redistribution or reproduction of part or all of the contents in any form is prohibited.  ",
    "intro": "Linkd. is an interactive network visualisation of a sample of my LinkedIn connections. It contains the attributes of Company, Education, Industry and Location. Nodes can be individually manipulated to ascertain more information relating to these attributes. Groups are organised according to Modularity Class.",
    "title": "Linkd."
  },
  "legend": {
    "edgeLabel": "Links",
    "colorLabel": "Modularity Class",
    "nodeLabel": "LinkedIn Connections"
  },
  "features": {
    "search": true,
    "groupSelectorAttribute": "education",
    "hoverBehavior": "default"
  },
  "informationPanel": {
    "groupByEdgeDirection": false,
    "imageAttribute": false
  },
  "sigma": {
    "drawingProperties": {
      "defaultEdgeType": "curve",
      "defaultHoverLabelBGColor": "#002147",
      "defaultLabelBGColor": "#ddd",
      "activeFontStyle": "bold",
      "defaultLabelColor": "#000",
      "labelThreshold": 10,
      "defaultLabelHoverColor": "#fff",
      "fontStyle": "bold",
      "hoverFontStyle": "bold",
      "defaultLabelSize": 14
    },
    "graphProperties": {
      "maxEdgeSize": 0.5,
      "minEdgeSize": 0.2,
      "minNodeSize": 1,
      "maxNodeSize": 7
    },
    "mouseProperties": {
      "maxRatio": 20,
      "minRatio": 0.75
    }
  }
}